ekobayuhit/ChibiOS-RT-LPC/os/hal/platforms/LPC43xx/hal_lld.h
#if LPC_IDIVE_SRC == CLK_SEL_32KHZ
#define  LPC_IDIVE_CLK     RTC_XTAL/LPC_IDIVE_DIV
#elif LPC_IDIVE_SRC == CLK_SEL_IRC
#define  LPC_IDIVE_CLK     IRCOSCCLK/LPC_IDIVE_DIV
#elif LPC_IDIVE_SRC == CLK_SEL_ENET_RX_CLK
#define  LPC_IDIVE_CLK     ENET_RX_CLK/LPC_IDIVE_DIV
#elif LPC_IDIVE_SRC == CLK_SEL_ENET_TX_CLK
#define  LPC_IDIVE_CLK     ENET_TX_CLK/LPC_IDIVE_DIV
#elif LPC_IDIVE_SRC == CLK_SEL_GP_CLKIN
#define  LPC_IDIVE_CLK     GP_CLKIN_CLK/LPC_IDIVE_DIV
#elif LPC_IDIVE_SRC == CLK_SEL_XTAL
#define  LPC_IDIVE_CLK     XTAL/LPC_IDIVE_DIV
#elif LPC_IDIVE_SRC == CLK_SEL_PLL0USB
#error   "LPC_IDIVE_CLK source can't be PLL0USB."
#elif LPC_IDIVE_SRC == CLK_SEL_PLL0AUDIO
#define  LPC_IDIVE_CLK     LPC_PLL0AUDIO_CLK/LPC_IDIVE_DIV
#elif LPC_IDIVE_SRC == CLK_SEL_PLL1
#define  LPC_IDIVE_CLK     LPC_PLL1_CLK/LPC_IDIVE_DIV
#elif LPC_IDIVE_SRC == CLK_SEL_IDIVA
#define  LPC_IDIVE_CLK     LPC_IDIVA_CLK/LPC_IDIVE_DIV
#elif LPC_IDIVE_SRC == CLK_SEL_IDIVB
#error   "LPC_IDIVE_CLK source can't be IDIVB_CLK."
#elif LPC_IDIVE_SRC == CLK_SEL_IDIVC
#error   "LPC_IDIVE_CLK source can't be IDIVC_CLK."
#elif LPC_IDIVE_SRC == CLK_SEL_IDIVD
#error   "LPC_IDIVE_CLK source can't be IDIVD_CLK."
#elif LPC_IDIVE_SRC == CLK_SEL_IDIVE
#error   "LPC_IDIVE_CLK source can't be IDIVE_CLK."
#else
#error  "LPC_IDIVE_CLK wrong clock source."
#endif

/**
 * @brief   Peripheral clocks frequency.
 */
#if LPC_BASE_PERIPH_CLK_SRC == CLK_SEL_32KHZ
#define  LPC_BASE_PERIPH_CLK     RTC_XTAL
#elif LPC_BASE_PERIPH_CLK_SRC == CLK_SEL_IRC
#define  LPC_BASE_PERIPH_CLK     IRCOSCCLK
#elif LPC_BASE_PERIPH_CLK_SRC == CLK_SEL_ENET_RX_CLK
#define  LPC_BASE_PERIPH_CLK     ENET_RX_CLK
#elif LPC_BASE_PERIPH_CLK_SRC == CLK_SEL_ENET_TX_CLK
#define  LPC_BASE_PERIPH_CLK     ENET_TX_CLK
#elif LPC_BASE_PERIPH_CLK_SRC == CLK_SEL_GP_CLKIN
#define  LPC_BASE_PERIPH_CLK     GP_CLKIN_CLK
#elif LPC_BASE_PERIPH_CLK_SRC == CLK_SEL_XTAL
#define  LPC_BASE_PERIPH_CLK     XTAL
#elif LPC_BASE_PERIPH_CLK_SRC == CLK_SEL_PLL0USB
#error   "LPC_BASE_PERIPH_CLK source can't be PLL0USB."
#elif LPC_BASE_PERIPH_CLK_SRC == CLK_SEL_PLL0AUDIO
#define  LPC_BASE_PERIPH_CLK     LPC_PLL0AUDIO_CLK
#elif LPC_BASE_PERIPH_CLK_SRC == CLK_SEL_PLL1
#define  LPC_BASE_PERIPH_CLK     LPC_PLL1_CLK
#elif LPC_BASE_PERIPH_CLK_SRC == CLK_SEL_IDIVA
#define  LPC_BASE_PERIPH_CLK     LPC_IDIVA_CLK
#elif LPC_BASE_PERIPH_CLK_SRC == CLK_SEL_IDIVB
#define  LPC_BASE_PERIPH_CLK     LPC_IDIVB_CLK
#elif LPC_BASE_PERIPH_CLK_SRC == CLK_SEL_IDIVC
#define  LPC_BASE_PERIPH_CLK     LPC_IDIVC_CLK
#elif LPC_BASE_PERIPH_CLK_SRC == CLK_SEL_IDIVD
#define  LPC_BASE_PERIPH_CLK     LPC_IDIVD_CLK
#elif LPC_BASE_PERIPH_CLK_SRC == CLK_SEL_IDIVE
#define  LPC_BASE_PERIPH_CLK     LPC_IDIVE_CLK
#else
#error  "LPC_BASE_PERIPH_CLK wrong clock source."
#endif

#if LPC_BASE_USB1_CLK_SRC == CLK_SEL_32KHZ
#define  LPC_BASE_USB1_CLK     RTC_XTAL
#elif LPC_BASE_USB1_CLK_SRC == CLK_SEL_IRC
#define  LPC_BASE_USB1_CLK     IRCOSCCLK
#elif LPC_BASE_USB1_CLK_SRC == CLK_SEL_ENET_RX_CLK
#define  LPC_BASE_USB1_CLK     ENET_RX_CLK
#elif LPC_BASE_USB1_CLK_SRC == CLK_SEL_ENET_TX_CLK
#define  LPC_BASE_USB1_CLK     ENET_TX_CLK
#elif LPC_BASE_USB1_CLK_SRC == CLK_SEL_GP_CLKIN
#define  LPC_BASE_USB1_CLK     GP_CLKIN_CLK
#elif LPC_BASE_USB1_CLK_SRC == CLK_SEL_XTAL
#define  LPC_BASE_USB1_CLK     XTAL
#elif LPC_BASE_USB1_CLK_SRC == CLK_SEL_PLL0USB
#define  LPC_BASE_USB1_CLK     LPC_PLL0USB_CLK
#elif LPC_BASE_USB1_CLK_SRC == CLK_SEL_PLL0AUDIO
#define  LPC_BASE_USB1_CLK     LPC_PLL0AUDIO_CLK
#elif LPC_BASE_USB1_CLK_SRC == CLK_SEL_PLL1
#define  LPC_BASE_USB1_CLK     LPC_PLL1_CLK
#elif LPC_BASE_USB1_CLK_SRC == CLK_SEL_IDIVA
#define  LPC_BASE_USB1_CLK     LPC_IDIVA_CLK
#elif LPC_BASE_USB1_CLK_SRC == CLK_SEL_IDIVB
#define  LPC_BASE_USB1_CLK     LPC_IDIVB_CLK
#elif LPC_BASE_USB1_CLK_SRC == CLK_SEL_IDIVC
#define  LPC_BASE_USB1_CLK     LPC_IDIVC_CLK
#elif LPC_BASE_USB1_CLK_SRC == CLK_SEL_IDIVD
#define  LPC_BASE_USB1_CLK     LPC_IDIVD_CLK
#elif LPC_BASE_USB1_CLK_SRC == CLK_SEL_IDIVE
#define  LPC_BASE_USB1_CLK     LPC_IDIVE_CLK
#else
#error  "LPC_BASE_USB1_CLK wrong clock source."
#endif

#if LPC_BASE_SPIFI_CLK_SRC == CLK_SEL_32KHZ
#define  LPC_BASE_SPIFI_CLK     RTC_XTAL
#elif LPC_BASE_SPIFI_CLK_SRC == CLK_SEL_IRC
#define  LPC_BASE_SPIFI_CLK     IRCOSCCLK
#elif LPC_BASE_SPIFI_CLK_SRC == CLK_SEL_ENET_RX_CLK
#define  LPC_BASE_SPIFI_CLK     ENET_RX_CLK
#elif LPC_BASE_SPIFI_CLK_SRC == CLK_SEL_ENET_TX_CLK
#define  LPC_BASE_SPIFI_CLK     ENET_TX_CLK
#elif LPC_BASE_SPIFI_CLK_SRC == CLK_SEL_GP_CLKIN
#define  LPC_BASE_SPIFI_CLK     GP_CLKIN_CLK
#elif LPC_BASE_SPIFI_CLK_SRC == CLK_SEL_XTAL
#define  LPC_BASE_SPIFI_CLK     XTAL
#elif LPC_BASE_SPIFI_CLK_SRC == CLK_SEL_PLL0USB
#error   "LPC_BASE_SPIFI_CLK source can't be PLL0USB."
#elif LPC_BASE_SPIFI_CLK_SRC == CLK_SEL_PLL0AUDIO
#define  LPC_BASE_SPIFI_CLK     LPC_PLL0AUDIO_CLK
#elif LPC_BASE_SPIFI_CLK_SRC == CLK_SEL_PLL1
#define  LPC_BASE_SPIFI_CLK     LPC_PLL1_CLK
#elif LPC_BASE_SPIFI_CLK_SRC == CLK_SEL_IDIVA
#define  LPC_BASE_SPIFI_CLK     LPC_IDIVA_CLK
#elif LPC_BASE_SPIFI_CLK_SRC == CLK_SEL_IDIVB
#define  LPC_BASE_SPIFI_CLK     LPC_IDIVB_CLK
#elif LPC_BASE_SPIFI_CLK_SRC == CLK_SEL_IDIVC
#define  LPC_BASE_SPIFI_CLK     LPC_IDIVC_CLK
#elif LPC_BASE_SPIFI_CLK_SRC == CLK_SEL_IDIVD
#define  LPC_BASE_SPIFI_CLK     LPC_IDIVD_CLK
#elif LPC_BASE_SPIFI_CLK_SRC == CLK_SEL_IDIVE
#define  LPC_BASE_SPIFI_CLK     LPC_IDIVE_CLK
#else
#error  "LPC_BASE_SPIFI_CLK wrong clock source."
#endif

#if LPC_BASE_SPI_CLK_SRC == CLK_SEL_32KHZ
#define  LPC_BASE_SPI_CLK     RTC_XTAL
#elif LPC_BASE_SPI_CLK_SRC == CLK_SEL_IRC
#define  LPC_BASE_SPI_CLK     IRCOSCCLK
#elif LPC_BASE_SPI_CLK_SRC == CLK_SEL_ENET_RX_CLK
#define  LPC_BASE_SPI_CLK     ENET_RX_CLK
#elif LPC_BASE_SPI_CLK_SRC == CLK_SEL_ENET_TX_CLK
#define  LPC_BASE_SPI_CLK     ENET_TX_CLK
#elif LPC_BASE_SPI_CLK_SRC == CLK_SEL_GP_CLKIN
#define  LPC_BASE_SPI_CLK     GP_CLKIN_CLK
#elif LPC_BASE_SPI_CLK_SRC == CLK_SEL_XTAL
#define  LPC_BASE_SPI_CLK     XTAL
#elif LPC_BASE_SPI_CLK_SRC == CLK_SEL_PLL0USB
#error   "LPC_BASE_SPI_CLK source can't be PLL0USB."
#elif LPC_BASE_SPI_CLK_SRC == CLK_SEL_PLL0AUDIO
#define  LPC_BASE_SPI_CLK     LPC_PLL0AUDIO_CLK
#elif LPC_BASE_SPI_CLK_SRC == CLK_SEL_PLL1
#define  LPC_BASE_SPI_CLK     LPC_PLL1_CLK
#elif LPC_BASE_SPI_CLK_SRC == CLK_SEL_IDIVA
#define  LPC_BASE_SPI_CLK     LPC_IDIVA_CLK
#elif LPC_BASE_SPI_CLK_SRC == CLK_SEL_IDIVB
#define  LPC_BASE_SPI_CLK     LPC_IDIVB_CLK
#elif LPC_BASE_SPI_CLK_SRC == CLK_SEL_IDIVC
#define  LPC_BASE_SPI_CLK     LPC_IDIVC_CLK
#elif LPC_BASE_SPI_CLK_SRC == CLK_SEL_IDIVD
#define  LPC_BASE_SPI_CLK     LPC_IDIVD_CLK
#elif LPC_BASE_SPI_CLK_SRC == CLK_SEL_IDIVE
#define  LPC_BASE_SPI_CLK     LPC_IDIVE_CLK
#else
#error  "LPC_BASE_SPI_CLK wrong clock source."
#endif

