ekobayuhit/ChibiOS-RT-LPC/os/hal/platforms/LPC43xx/hal_lld.h
#if LPC_BASE_PHY_RX_CLK_SRC == CLK_SEL_32KHZ
#define  LPC_BASE_PHY_RX_CLK     RTC_XTAL
#elif LPC_BASE_PHY_RX_CLK_SRC == CLK_SEL_IRC
#define  LPC_BASE_PHY_RX_CLK     IRCOSCCLK
#elif LPC_BASE_PHY_RX_CLK_SRC == CLK_SEL_ENET_RX_CLK
#define  LPC_BASE_PHY_RX_CLK     ENET_RX_CLK
#elif LPC_BASE_PHY_RX_CLK_SRC == CLK_SEL_ENET_TX_CLK
#define  LPC_BASE_PHY_RX_CLK     ENET_TX_CLK
#elif LPC_BASE_PHY_RX_CLK_SRC == CLK_SEL_GP_CLKIN
#define  LPC_BASE_PHY_RX_CLK     GP_CLKIN_CLK
#elif LPC_BASE_PHY_RX_CLK_SRC == CLK_SEL_XTAL
#define  LPC_BASE_PHY_RX_CLK     XTAL
#elif LPC_BASE_PHY_RX_CLK_SRC == CLK_SEL_PLL0USB
#error   "LPC_BASE_PHY_RX_CLK source can't be PLL0USB."
#elif LPC_BASE_PHY_RX_CLK_SRC == CLK_SEL_PLL0AUDIO
#define  LPC_BASE_PHY_RX_CLK     LPC_PLL0AUDIO_CLK
#elif LPC_BASE_PHY_RX_CLK_SRC == CLK_SEL_PLL1
#define  LPC_BASE_PHY_RX_CLK     LPC_PLL1_CLK
#elif LPC_BASE_PHY_RX_CLK_SRC == CLK_SEL_IDIVA
#define  LPC_BASE_PHY_RX_CLK     LPC_IDIVA_CLK
#elif LPC_BASE_PHY_RX_CLK_SRC == CLK_SEL_IDIVB
#define  LPC_BASE_PHY_RX_CLK     LPC_IDIVB_CLK
#elif LPC_BASE_PHY_RX_CLK_SRC == CLK_SEL_IDIVC
#define  LPC_BASE_PHY_RX_CLK     LPC_IDIVC_CLK
#elif LPC_BASE_PHY_RX_CLK_SRC == CLK_SEL_IDIVD
#define  LPC_BASE_PHY_RX_CLK     LPC_IDIVD_CLK
#elif LPC_BASE_PHY_RX_CLK_SRC == CLK_SEL_IDIVE
#define  LPC_BASE_PHY_RX_CLK     LPC_IDIVE_CLK
#else
#error  "LPC_BASE_PHY_RX_CLK wrong clock source."
#endif

#if LPC_BASE_PHY_TX_CLK_SRC == CLK_SEL_32KHZ
#define  LPC_BASE_PHY_TX_CLK     RTC_XTAL
#elif LPC_BASE_PHY_TX_CLK_SRC == CLK_SEL_IRC
#define  LPC_BASE_PHY_TX_CLK     IRCOSCCLK
#elif LPC_BASE_PHY_TX_CLK_SRC == CLK_SEL_ENET_RX_CLK
#define  LPC_BASE_PHY_TX_CLK     ENET_RX_CLK
#elif LPC_BASE_PHY_TX_CLK_SRC == CLK_SEL_ENET_TX_CLK
#define  LPC_BASE_PHY_TX_CLK     ENET_TX_CLK
#elif LPC_BASE_PHY_TX_CLK_SRC == CLK_SEL_GP_CLKIN
#define  LPC_BASE_PHY_TX_CLK     GP_CLKIN_CLK
#elif LPC_BASE_PHY_TX_CLK_SRC == CLK_SEL_XTAL
#define  LPC_BASE_PHY_TX_CLK     XTAL
#elif LPC_BASE_PHY_TX_CLK_SRC == CLK_SEL_PLL0USB
#error   "LPC_BASE_PHY_TX_CLK source can't be PLL0USB."
#elif LPC_BASE_PHY_TX_CLK_SRC == CLK_SEL_PLL0AUDIO
#define  LPC_BASE_PHY_TX_CLK     LPC_PLL0AUDIO_CLK
#elif LPC_BASE_PHY_TX_CLK_SRC == CLK_SEL_PLL1
#define  LPC_BASE_PHY_TX_CLK     LPC_PLL1_CLK
#elif LPC_BASE_PHY_TX_CLK_SRC == CLK_SEL_IDIVA
#define  LPC_BASE_PHY_TX_CLK     LPC_IDIVA_CLK
#elif LPC_BASE_PHY_TX_CLK_SRC == CLK_SEL_IDIVB
#define  LPC_BASE_PHY_TX_CLK     LPC_IDIVB_CLK
#elif LPC_BASE_PHY_TX_CLK_SRC == CLK_SEL_IDIVC
#define  LPC_BASE_PHY_TX_CLK     LPC_IDIVC_CLK
#elif LPC_BASE_PHY_TX_CLK_SRC == CLK_SEL_IDIVD
#define  LPC_BASE_PHY_TX_CLK     LPC_IDIVD_CLK
#elif LPC_BASE_PHY_TX_CLK_SRC == CLK_SEL_IDIVE
#define  LPC_BASE_PHY_TX_CLK     LPC_IDIVE_CLK
#else
#error  "LPC_BASE_PHY_TX_CLK wrong clock source."
#endif

#if LPC_BASE_APB1_CLK_SRC == CLK_SEL_32KHZ
#define  LPC_BASE_APB1_CLK     RTC_XTAL
#elif LPC_BASE_APB1_CLK_SRC == CLK_SEL_IRC
#define  LPC_BASE_APB1_CLK     IRCOSCCLK
#elif LPC_BASE_APB1_CLK_SRC == CLK_SEL_ENET_RX_CLK
#define  LPC_BASE_APB1_CLK     ENET_RX_CLK
#elif LPC_BASE_APB1_CLK_SRC == CLK_SEL_ENET_TX_CLK
#define  LPC_BASE_APB1_CLK     ENET_TX_CLK
#elif LPC_BASE_APB1_CLK_SRC == CLK_SEL_GP_CLKIN
#define  LPC_BASE_APB1_CLK     GP_CLKIN_CLK
#elif LPC_BASE_APB1_CLK_SRC == CLK_SEL_XTAL
#define  LPC_BASE_APB1_CLK     XTAL
#elif LPC_BASE_APB1_CLK_SRC == CLK_SEL_PLL0USB
#error   "LPC_BASE_APB1_CLK source can't be PLL0USB."
#elif LPC_BASE_APB1_CLK_SRC == CLK_SEL_PLL0AUDIO
#define  LPC_BASE_APB1_CLK     LPC_PLL0AUDIO_CLK
#elif LPC_BASE_APB1_CLK_SRC == CLK_SEL_PLL1
#define  LPC_BASE_APB1_CLK     LPC_PLL1_CLK
#elif LPC_BASE_APB1_CLK_SRC == CLK_SEL_IDIVA
#define  LPC_BASE_APB1_CLK     LPC_IDIVA_CLK
#elif LPC_BASE_APB1_CLK_SRC == CLK_SEL_IDIVB
#define  LPC_BASE_APB1_CLK     LPC_IDIVB_CLK
#elif LPC_BASE_APB1_CLK_SRC == CLK_SEL_IDIVC
#define  LPC_BASE_APB1_CLK     LPC_IDIVC_CLK
#elif LPC_BASE_APB1_CLK_SRC == CLK_SEL_IDIVD
#define  LPC_BASE_APB1_CLK     LPC_IDIVD_CLK
#elif LPC_BASE_APB1_CLK_SRC == CLK_SEL_IDIVE
#define  LPC_BASE_APB1_CLK     LPC_IDIVE_CLK
#else
#error  "LPC_BASE_APB1_CLK wrong clock source."
#endif

#if LPC_BASE_APB3_CLK_SRC == CLK_SEL_32KHZ
#define  LPC_BASE_APB3_CLK     RTC_XTAL
#elif LPC_BASE_APB3_CLK_SRC == CLK_SEL_IRC
#define  LPC_BASE_APB3_CLK     IRCOSCCLK
#elif LPC_BASE_APB3_CLK_SRC == CLK_SEL_ENET_RX_CLK
#define  LPC_BASE_APB3_CLK     ENET_RX_CLK
#elif LPC_BASE_APB3_CLK_SRC == CLK_SEL_ENET_TX_CLK
#define  LPC_BASE_APB3_CLK     ENET_TX_CLK
#elif LPC_BASE_APB3_CLK_SRC == CLK_SEL_GP_CLKIN
#define  LPC_BASE_APB3_CLK     GP_CLKIN_CLK
#elif LPC_BASE_APB3_CLK_SRC == CLK_SEL_XTAL
#define  LPC_BASE_APB3_CLK     XTAL
#elif LPC_BASE_APB3_CLK_SRC == CLK_SEL_PLL0USB
#error   "LPC_BASE_APB3_CLK source can't be PLL0USB."
#elif LPC_BASE_APB3_CLK_SRC == CLK_SEL_PLL0AUDIO
#define  LPC_BASE_APB3_CLK     LPC_PLL0AUDIO_CLK
#elif LPC_BASE_APB3_CLK_SRC == CLK_SEL_PLL1
#define  LPC_BASE_APB3_CLK     LPC_PLL1_CLK
#elif LPC_BASE_APB3_CLK_SRC == CLK_SEL_IDIVA
#define  LPC_BASE_APB3_CLK     LPC_IDIVA_CLK
#elif LPC_BASE_APB3_CLK_SRC == CLK_SEL_IDIVB
#define  LPC_BASE_APB3_CLK     LPC_IDIVB_CLK
#elif LPC_BASE_APB3_CLK_SRC == CLK_SEL_IDIVC
#define  LPC_BASE_APB3_CLK     LPC_IDIVC_CLK
#elif LPC_BASE_APB3_CLK_SRC == CLK_SEL_IDIVD
#define  LPC_BASE_APB3_CLK     LPC_IDIVD_CLK
#elif LPC_BASE_APB3_CLK_SRC == CLK_SEL_IDIVE
#define  LPC_BASE_APB3_CLK     LPC_IDIVE_CLK
#else
#error  "LPC_BASE_APB3_CLK wrong clock source."
#endif

#if LPC_BASE_LCD_CLK_SRC == CLK_SEL_32KHZ
#define  LPC_BASE_LCD_CLK     RTC_XTAL
#elif LPC_BASE_LCD_CLK_SRC == CLK_SEL_IRC
#define  LPC_BASE_LCD_CLK     IRCOSCCLK
#elif LPC_BASE_LCD_CLK_SRC == CLK_SEL_ENET_RX_CLK
#define  LPC_BASE_LCD_CLK     ENET_RX_CLK
#elif LPC_BASE_LCD_CLK_SRC == CLK_SEL_ENET_TX_CLK
#define  LPC_BASE_LCD_CLK     ENET_TX_CLK
#elif LPC_BASE_LCD_CLK_SRC == CLK_SEL_GP_CLKIN
#define  LPC_BASE_LCD_CLK     GP_CLKIN_CLK
#elif LPC_BASE_LCD_CLK_SRC == CLK_SEL_XTAL
#define  LPC_BASE_LCD_CLK     XTAL
#elif LPC_BASE_LCD_CLK_SRC == CLK_SEL_PLL0USB
#error   "LPC_BASE_LCD_CLK source can't be PLL0USB."
#elif LPC_BASE_LCD_CLK_SRC == CLK_SEL_PLL0AUDIO
#define  LPC_BASE_LCD_CLK     LPC_PLL0AUDIO_CLK
#elif LPC_BASE_LCD_CLK_SRC == CLK_SEL_PLL1
#define  LPC_BASE_LCD_CLK     LPC_PLL1_CLK
#elif LPC_BASE_LCD_CLK_SRC == CLK_SEL_IDIVA
#define  LPC_BASE_LCD_CLK     LPC_IDIVA_CLK
#elif LPC_BASE_LCD_CLK_SRC == CLK_SEL_IDIVB
#define  LPC_BASE_LCD_CLK     LPC_IDIVB_CLK
#elif LPC_BASE_LCD_CLK_SRC == CLK_SEL_IDIVC
#define  LPC_BASE_LCD_CLK     LPC_IDIVC_CLK
#elif LPC_BASE_LCD_CLK_SRC == CLK_SEL_IDIVD
#define  LPC_BASE_LCD_CLK     LPC_IDIVD_CLK
#elif LPC_BASE_LCD_CLK_SRC == CLK_SEL_IDIVE
#define  LPC_BASE_LCD_CLK     LPC_IDIVE_CLK
#else
#error  "LPC_BASE_LCD_CLK wrong clock source."
#endif

#if LPC_BASE_SDIO_CLK_SRC == CLK_SEL_32KHZ
#define  LPC_BASE_SDIO_CLK     RTC_XTAL
#elif LPC_BASE_SDIO_CLK_SRC == CLK_SEL_IRC
#define  LPC_BASE_SDIO_CLK     IRCOSCCLK
#elif LPC_BASE_SDIO_CLK_SRC == CLK_SEL_ENET_RX_CLK
#define  LPC_BASE_SDIO_CLK     ENET_RX_CLK
#elif LPC_BASE_SDIO_CLK_SRC == CLK_SEL_ENET_TX_CLK
#define  LPC_BASE_SDIO_CLK     ENET_TX_CLK
#elif LPC_BASE_SDIO_CLK_SRC == CLK_SEL_GP_CLKIN
#define  LPC_BASE_SDIO_CLK     GP_CLKIN_CLK
#elif LPC_BASE_SDIO_CLK_SRC == CLK_SEL_XTAL
#define  LPC_BASE_SDIO_CLK     XTAL
#elif LPC_BASE_SDIO_CLK_SRC == CLK_SEL_PLL0USB
#error   "LPC_BASE_SDIO_CLK source can't be PLL0USB."
#elif LPC_BASE_SDIO_CLK_SRC == CLK_SEL_PLL0AUDIO
#define  LPC_BASE_SDIO_CLK     LPC_PLL0AUDIO_CLK
#elif LPC_BASE_SDIO_CLK_SRC == CLK_SEL_PLL1
#define  LPC_BASE_SDIO_CLK     LPC_PLL1_CLK
#elif LPC_BASE_SDIO_CLK_SRC == CLK_SEL_IDIVA
#define  LPC_BASE_SDIO_CLK     LPC_IDIVA_CLK
#elif LPC_BASE_SDIO_CLK_SRC == CLK_SEL_IDIVB
#define  LPC_BASE_SDIO_CLK     LPC_IDIVB_CLK
#elif LPC_BASE_SDIO_CLK_SRC == CLK_SEL_IDIVC
#define  LPC_BASE_SDIO_CLK     LPC_IDIVC_CLK
#elif LPC_BASE_SDIO_CLK_SRC == CLK_SEL_IDIVD
#define  LPC_BASE_SDIO_CLK     LPC_IDIVD_CLK
#elif LPC_BASE_SDIO_CLK_SRC == CLK_SEL_IDIVE
#define  LPC_BASE_SDIO_CLK     LPC_IDIVE_CLK
#else
#error  "LPC_BASE_SDIO_CLK wrong clock source."
#endif

#if LPC_BASE_SSP0_CLK_SRC == CLK_SEL_32KHZ
#define  LPC_BASE_SSP0_CLK     RTC_XTAL
#elif LPC_BASE_SSP0_CLK_SRC == CLK_SEL_IRC
#define  LPC_BASE_SSP0_CLK     IRCOSCCLK
#elif LPC_BASE_SSP0_CLK_SRC == CLK_SEL_ENET_RX_CLK
#define  LPC_BASE_SSP0_CLK     ENET_RX_CLK
#elif LPC_BASE_SSP0_CLK_SRC == CLK_SEL_ENET_TX_CLK
#define  LPC_BASE_SSP0_CLK     ENET_TX_CLK
#elif LPC_BASE_SSP0_CLK_SRC == CLK_SEL_GP_CLKIN
#define  LPC_BASE_SSP0_CLK     GP_CLKIN_CLK
#elif LPC_BASE_SSP0_CLK_SRC == CLK_SEL_XTAL
#define  LPC_BASE_SSP0_CLK     XTAL
#elif LPC_BASE_SSP0_CLK_SRC == CLK_SEL_PLL0USB
#error   "LPC_BASE_SSP0_CLK source can't be PLL0USB."
#elif LPC_BASE_SSP0_CLK_SRC == CLK_SEL_PLL0AUDIO
#define  LPC_BASE_SSP0_CLK     LPC_PLL0AUDIO_CLK
#elif LPC_BASE_SSP0_CLK_SRC == CLK_SEL_PLL1
#define  LPC_BASE_SSP0_CLK     LPC_PLL1_CLK
#elif LPC_BASE_SSP0_CLK_SRC == CLK_SEL_IDIVA
#define  LPC_BASE_SSP0_CLK     LPC_IDIVA_CLK
#elif LPC_BASE_SSP0_CLK_SRC == CLK_SEL_IDIVB
#define  LPC_BASE_SSP0_CLK     LPC_IDIVB_CLK
#elif LPC_BASE_SSP0_CLK_SRC == CLK_SEL_IDIVC
#define  LPC_BASE_SSP0_CLK     LPC_IDIVC_CLK
#elif LPC_BASE_SSP0_CLK_SRC == CLK_SEL_IDIVD
#define  LPC_BASE_SSP0_CLK     LPC_IDIVD_CLK
#elif LPC_BASE_SSP0_CLK_SRC == CLK_SEL_IDIVE
#define  LPC_BASE_SSP0_CLK     LPC_IDIVE_CLK
#else
#error  "LPC_BASE_SSP0_CLK wrong clock source."
#endif

