ekobayuhit/ChibiOS-RT-LPC/os/hal/platforms/LPC43xx/hal_lld.h
#if LPC_BASE_SSP1_CLK_SRC == CLK_SEL_32KHZ
#define  LPC_BASE_SSP1_CLK     RTC_XTAL
#elif LPC_BASE_SSP1_CLK_SRC == CLK_SEL_IRC
#define  LPC_BASE_SSP1_CLK     IRCOSCCLK
#elif LPC_BASE_SSP1_CLK_SRC == CLK_SEL_ENET_RX_CLK
#define  LPC_BASE_SSP1_CLK     ENET_RX_CLK
#elif LPC_BASE_SSP1_CLK_SRC == CLK_SEL_ENET_TX_CLK
#define  LPC_BASE_SSP1_CLK     ENET_TX_CLK
#elif LPC_BASE_SSP1_CLK_SRC == CLK_SEL_GP_CLKIN
#define  LPC_BASE_SSP1_CLK     GP_CLKIN_CLK
#elif LPC_BASE_SSP1_CLK_SRC == CLK_SEL_XTAL
#define  LPC_BASE_SSP1_CLK     XTAL
#elif LPC_BASE_SSP1_CLK_SRC == CLK_SEL_PLL0USB
#error   "LPC_BASE_SSP1_CLK source can't be PLL0USB."
#elif LPC_BASE_SSP1_CLK_SRC == CLK_SEL_PLL0AUDIO
#define  LPC_BASE_SSP1_CLK     LPC_PLL0AUDIO_CLK
#elif LPC_BASE_SSP1_CLK_SRC == CLK_SEL_PLL1
#define  LPC_BASE_SSP1_CLK     LPC_PLL1_CLK
#elif LPC_BASE_SSP1_CLK_SRC == CLK_SEL_IDIVA
#define  LPC_BASE_SSP1_CLK     LPC_IDIVA_CLK
#elif LPC_BASE_SSP1_CLK_SRC == CLK_SEL_IDIVB
#define  LPC_BASE_SSP1_CLK     LPC_IDIVB_CLK
#elif LPC_BASE_SSP1_CLK_SRC == CLK_SEL_IDIVC
#define  LPC_BASE_SSP1_CLK     LPC_IDIVC_CLK
#elif LPC_BASE_SSP1_CLK_SRC == CLK_SEL_IDIVD
#define  LPC_BASE_SSP1_CLK     LPC_IDIVD_CLK
#elif LPC_BASE_SSP1_CLK_SRC == CLK_SEL_IDIVE
#define  LPC_BASE_SSP1_CLK     LPC_IDIVE_CLK
#else
#error  "LPC_BASE_SSP1_CLK wrong clock source."
#endif

#if LPC_BASE_UART0_CLK_SRC == CLK_SEL_32KHZ
#define  LPC_BASE_UART0_CLK     RTC_XTAL
#elif LPC_BASE_UART0_CLK_SRC == CLK_SEL_IRC
#define  LPC_BASE_UART0_CLK     IRCOSCCLK
#elif LPC_BASE_UART0_CLK_SRC == CLK_SEL_ENET_RX_CLK
#define  LPC_BASE_UART0_CLK     ENET_RX_CLK
#elif LPC_BASE_UART0_CLK_SRC == CLK_SEL_ENET_TX_CLK
#define  LPC_BASE_UART0_CLK     ENET_TX_CLK
#elif LPC_BASE_UART0_CLK_SRC == CLK_SEL_GP_CLKIN
#define  LPC_BASE_UART0_CLK     GP_CLKIN_CLK
#elif LPC_BASE_UART0_CLK_SRC == CLK_SEL_XTAL
#define  LPC_BASE_UART0_CLK     XTAL
#elif LPC_BASE_UART0_CLK_SRC == CLK_SEL_PLL0USB
#error   "LPC_BASE_UART0_CLK source can't be PLL0USB."
#elif LPC_BASE_UART0_CLK_SRC == CLK_SEL_PLL0AUDIO
#define  LPC_BASE_UART0_CLK     LPC_PLL0AUDIO_CLK
#elif LPC_BASE_UART0_CLK_SRC == CLK_SEL_PLL1
#define  LPC_BASE_UART0_CLK     LPC_PLL1_CLK
#elif LPC_BASE_UART0_CLK_SRC == CLK_SEL_IDIVA
#define  LPC_BASE_UART0_CLK     LPC_IDIVA_CLK
#elif LPC_BASE_UART0_CLK_SRC == CLK_SEL_IDIVB
#define  LPC_BASE_UART0_CLK     LPC_IDIVB_CLK
#elif LPC_BASE_UART0_CLK_SRC == CLK_SEL_IDIVC
#define  LPC_BASE_UART0_CLK     LPC_IDIVC_CLK
#elif LPC_BASE_UART0_CLK_SRC == CLK_SEL_IDIVD
#define  LPC_BASE_UART0_CLK     LPC_IDIVD_CLK
#elif LPC_BASE_UART0_CLK_SRC == CLK_SEL_IDIVE
#define  LPC_BASE_UART0_CLK     LPC_IDIVE_CLK
#else
#error  "LPC_BASE_UART0_CLK wrong clock source."
#endif

#if LPC_BASE_UART1_CLK_SRC == CLK_SEL_32KHZ
#define  LPC_BASE_UART1_CLK     RTC_XTAL
#elif LPC_BASE_UART1_CLK_SRC == CLK_SEL_IRC
#define  LPC_BASE_UART1_CLK     IRCOSCCLK
#elif LPC_BASE_UART1_CLK_SRC == CLK_SEL_ENET_RX_CLK
#define  LPC_BASE_UART1_CLK     ENET_RX_CLK
#elif LPC_BASE_UART1_CLK_SRC == CLK_SEL_ENET_TX_CLK
#define  LPC_BASE_UART1_CLK     ENET_TX_CLK
#elif LPC_BASE_UART1_CLK_SRC == CLK_SEL_GP_CLKIN
#define  LPC_BASE_UART1_CLK     GP_CLKIN_CLK
#elif LPC_BASE_UART1_CLK_SRC == CLK_SEL_XTAL
#define  LPC_BASE_UART1_CLK     XTAL
#elif LPC_BASE_UART1_CLK_SRC == CLK_SEL_PLL0USB
#error   "LPC_BASE_UART1_CLK source can't be PLL0USB."
#elif LPC_BASE_UART1_CLK_SRC == CLK_SEL_PLL0AUDIO
#define  LPC_BASE_UART1_CLK     LPC_PLL0AUDIO_CLK
#elif LPC_BASE_UART1_CLK_SRC == CLK_SEL_PLL1
#define  LPC_BASE_UART1_CLK     LPC_PLL1_CLK
#elif LPC_BASE_UART1_CLK_SRC == CLK_SEL_IDIVA
#define  LPC_BASE_UART1_CLK     LPC_IDIVA_CLK
#elif LPC_BASE_UART1_CLK_SRC == CLK_SEL_IDIVB
#define  LPC_BASE_UART1_CLK     LPC_IDIVB_CLK
#elif LPC_BASE_UART1_CLK_SRC == CLK_SEL_IDIVC
#define  LPC_BASE_UART1_CLK     LPC_IDIVC_CLK
#elif LPC_BASE_UART1_CLK_SRC == CLK_SEL_IDIVD
#define  LPC_BASE_UART1_CLK     LPC_IDIVD_CLK
#elif LPC_BASE_UART1_CLK_SRC == CLK_SEL_IDIVE
#define  LPC_BASE_UART1_CLK     LPC_IDIVE_CLK
#else
#error  "LPC_BASE_UART1_CLK wrong clock source."
#endif

#if LPC_BASE_UART2_CLK_SRC == CLK_SEL_32KHZ
#define  LPC_BASE_UART2_CLK     RTC_XTAL
#elif LPC_BASE_UART2_CLK_SRC == CLK_SEL_IRC
#define  LPC_BASE_UART2_CLK     IRCOSCCLK
#elif LPC_BASE_UART2_CLK_SRC == CLK_SEL_ENET_RX_CLK
#define  LPC_BASE_UART2_CLK     ENET_RX_CLK
#elif LPC_BASE_UART2_CLK_SRC == CLK_SEL_ENET_TX_CLK
#define  LPC_BASE_UART2_CLK     ENET_TX_CLK
#elif LPC_BASE_UART2_CLK_SRC == CLK_SEL_GP_CLKIN
#define  LPC_BASE_UART2_CLK     GP_CLKIN_CLK
#elif LPC_BASE_UART2_CLK_SRC == CLK_SEL_XTAL
#define  LPC_BASE_UART2_CLK     XTAL
#elif LPC_BASE_UART2_CLK_SRC == CLK_SEL_PLL0USB
#error   "LPC_BASE_UART2_CLK source can't be PLL0USB."
#elif LPC_BASE_UART2_CLK_SRC == CLK_SEL_PLL0AUDIO
#define  LPC_BASE_UART2_CLK     LPC_PLL0AUDIO_CLK
#elif LPC_BASE_UART2_CLK_SRC == CLK_SEL_PLL1
#define  LPC_BASE_UART2_CLK     LPC_PLL1_CLK
#elif LPC_BASE_UART2_CLK_SRC == CLK_SEL_IDIVA
#define  LPC_BASE_UART2_CLK     LPC_IDIVA_CLK
#elif LPC_BASE_UART2_CLK_SRC == CLK_SEL_IDIVB
#define  LPC_BASE_UART2_CLK     LPC_IDIVB_CLK
#elif LPC_BASE_UART2_CLK_SRC == CLK_SEL_IDIVC
#define  LPC_BASE_UART2_CLK     LPC_IDIVC_CLK
#elif LPC_BASE_UART2_CLK_SRC == CLK_SEL_IDIVD
#define  LPC_BASE_UART2_CLK     LPC_IDIVD_CLK
#elif LPC_BASE_UART2_CLK_SRC == CLK_SEL_IDIVE
#define  LPC_BASE_UART2_CLK     LPC_IDIVE_CLK
#else
#error  "LPC_BASE_UART2_CLK wrong clock source."
#endif

#if LPC_BASE_UART3_CLK_SRC == CLK_SEL_32KHZ
#define  LPC_BASE_UART3_CLK     RTC_XTAL
#elif LPC_BASE_UART3_CLK_SRC == CLK_SEL_IRC
#define  LPC_BASE_UART3_CLK     IRCOSCCLK
#elif LPC_BASE_UART3_CLK_SRC == CLK_SEL_ENET_RX_CLK
#define  LPC_BASE_UART3_CLK     ENET_RX_CLK
#elif LPC_BASE_UART3_CLK_SRC == CLK_SEL_ENET_TX_CLK
#define  LPC_BASE_UART3_CLK     ENET_TX_CLK
#elif LPC_BASE_UART3_CLK_SRC == CLK_SEL_GP_CLKIN
#define  LPC_BASE_UART3_CLK     GP_CLKIN_CLK
#elif LPC_BASE_UART3_CLK_SRC == CLK_SEL_XTAL
#define  LPC_BASE_UART3_CLK     XTAL
#elif LPC_BASE_UART3_CLK_SRC == CLK_SEL_PLL0USB
#error   "LPC_BASE_UART3_CLK source can't be PLL0USB."
#elif LPC_BASE_UART3_CLK_SRC == CLK_SEL_PLL0AUDIO
#define  LPC_BASE_UART3_CLK     LPC_PLL0AUDIO_CLK
#elif LPC_BASE_UART3_CLK_SRC == CLK_SEL_PLL1
#define  LPC_BASE_UART3_CLK     LPC_PLL1_CLK
#elif LPC_BASE_UART3_CLK_SRC == CLK_SEL_IDIVA
#define  LPC_BASE_UART3_CLK     LPC_IDIVA_CLK
#elif LPC_BASE_UART3_CLK_SRC == CLK_SEL_IDIVB
#define  LPC_BASE_UART3_CLK     LPC_IDIVB_CLK
#elif LPC_BASE_UART3_CLK_SRC == CLK_SEL_IDIVC
#define  LPC_BASE_UART3_CLK     LPC_IDIVC_CLK
#elif LPC_BASE_UART3_CLK_SRC == CLK_SEL_IDIVD
#define  LPC_BASE_UART3_CLK     LPC_IDIVD_CLK
#elif LPC_BASE_UART3_CLK_SRC == CLK_SEL_IDIVE
#define  LPC_BASE_UART3_CLK     LPC_IDIVE_CLK
#else
#error  "LPC_BASE_UART3_CLK wrong clock source."
#endif

