ekobayuhit/ChibiOS-RT-LPC/os/hal/platforms/LPC43xx/hal_lld.h
#if LPC_BASE_OUT_CLK_SRC == CLK_SEL_32KHZ
#define  LPC_BASE_OUT_CLK     RTC_XTAL
#elif LPC_BASE_OUT_CLK_SRC == CLK_SEL_IRC
#define  LPC_BASE_OUT_CLK     IRCOSCCLK
#elif LPC_BASE_OUT_CLK_SRC == CLK_SEL_ENET_RX_CLK
#define  LPC_BASE_OUT_CLK     ENET_RX_CLK
#elif LPC_BASE_OUT_CLK_SRC == CLK_SEL_ENET_TX_CLK
#define  LPC_BASE_OUT_CLK     ENET_TX_CLK
#elif LPC_BASE_OUT_CLK_SRC == CLK_SEL_GP_CLKIN
#define  LPC_BASE_OUT_CLK     GP_CLKIN_CLK
#elif LPC_BASE_OUT_CLK_SRC == CLK_SEL_XTAL
#define  LPC_BASE_OUT_CLK     XTAL
#elif LPC_BASE_OUT_CLK_SRC == CLK_SEL_PLL0USB
#error   "LPC_BASE_OUT_CLK source can't be PLL0USB."
#elif LPC_BASE_OUT_CLK_SRC == CLK_SEL_PLL0AUDIO
#define  LPC_BASE_OUT_CLK     LPC_PLL0AUDIO_CLK
#elif LPC_BASE_OUT_CLK_SRC == CLK_SEL_PLL1
#define  LPC_BASE_OUT_CLK     LPC_PLL1_CLK
#elif LPC_BASE_OUT_CLK_SRC == CLK_SEL_IDIVA
#define  LPC_BASE_OUT_CLK     LPC_IDIVA_CLK
#elif LPC_BASE_OUT_CLK_SRC == CLK_SEL_IDIVB
#define  LPC_BASE_OUT_CLK     LPC_IDIVB_CLK
#elif LPC_BASE_OUT_CLK_SRC == CLK_SEL_IDIVC
#define  LPC_BASE_OUT_CLK     LPC_IDIVC_CLK
#elif LPC_BASE_OUT_CLK_SRC == CLK_SEL_IDIVD
#define  LPC_BASE_OUT_CLK     LPC_IDIVD_CLK
#elif LPC_BASE_OUT_CLK_SRC == CLK_SEL_IDIVE
#define  LPC_BASE_OUT_CLK     LPC_IDIVE_CLK
#else
#error  "LPC_BASE_OUT_CLK wrong clock source."
#endif

#if LPC_BASE_APLL_CLK_SRC == CLK_SEL_32KHZ
#define  LPC_BASE_APLL_CLK     RTC_XTAL
#elif LPC_BASE_APLL_CLK_SRC == CLK_SEL_IRC
#define  LPC_BASE_APLL_CLK     IRCOSCCLK
#elif LPC_BASE_APLL_CLK_SRC == CLK_SEL_ENET_RX_CLK
#define  LPC_BASE_APLL_CLK     ENET_RX_CLK
#elif LPC_BASE_APLL_CLK_SRC == CLK_SEL_ENET_TX_CLK
#define  LPC_BASE_APLL_CLK     ENET_TX_CLK
#elif LPC_BASE_APLL_CLK_SRC == CLK_SEL_GP_CLKIN
#define  LPC_BASE_APLL_CLK     GP_CLKIN_CLK
#elif LPC_BASE_APLL_CLK_SRC == CLK_SEL_XTAL
#define  LPC_BASE_APLL_CLK     XTAL
#elif LPC_BASE_APLL_CLK_SRC == CLK_SEL_PLL0USB
#error   "LPC_BASE_APLL_CLK source can't be PLL0USB."
#elif LPC_BASE_APLL_CLK_SRC == CLK_SEL_PLL0AUDIO
#define  LPC_BASE_APLL_CLK     LPC_PLL0AUDIO_CLK
#elif LPC_BASE_APLL_CLK_SRC == CLK_SEL_PLL1
#define  LPC_BASE_APLL_CLK     LPC_PLL1_CLK
#elif LPC_BASE_APLL_CLK_SRC == CLK_SEL_IDIVA
#define  LPC_BASE_APLL_CLK     LPC_IDIVA_CLK
#elif LPC_BASE_APLL_CLK_SRC == CLK_SEL_IDIVB
#define  LPC_BASE_APLL_CLK     LPC_IDIVB_CLK
#elif LPC_BASE_APLL_CLK_SRC == CLK_SEL_IDIVC
#define  LPC_BASE_APLL_CLK     LPC_IDIVC_CLK
#elif LPC_BASE_APLL_CLK_SRC == CLK_SEL_IDIVD
#define  LPC_BASE_APLL_CLK     LPC_IDIVD_CLK
#elif LPC_BASE_APLL_CLK_SRC == CLK_SEL_IDIVE
#define  LPC_BASE_APLL_CLK     LPC_IDIVE_CLK
#else
#error  "LPC_BASE_APLL_CLK wrong clock source."
#endif

#if LPC_BASE_CGU_OUT0_CLK_SRC == CLK_SEL_32KHZ
#define  LPC_BASE_CGU_OUT0_CLK     RTC_XTAL
#elif LPC_BASE_CGU_OUT0_CLK_SRC == CLK_SEL_IRC
#define  LPC_BASE_CGU_OUT0_CLK     IRCOSCCLK
#elif LPC_BASE_CGU_OUT0_CLK_SRC == CLK_SEL_ENET_RX_CLK
#define  LPC_BASE_CGU_OUT0_CLK     ENET_RX_CLK
#elif LPC_BASE_CGU_OUT0_CLK_SRC == CLK_SEL_ENET_TX_CLK
#define  LPC_BASE_CGU_OUT0_CLK     ENET_TX_CLK
#elif LPC_BASE_CGU_OUT0_CLK_SRC == CLK_SEL_GP_CLKIN
#define  LPC_BASE_CGU_OUT0_CLK     GP_CLKIN_CLK
#elif LPC_BASE_CGU_OUT0_CLK_SRC == CLK_SEL_XTAL
#define  LPC_BASE_CGU_OUT0_CLK     XTAL
#elif LPC_BASE_CGU_OUT0_CLK_SRC == CLK_SEL_PLL0USB
#error   "LPC_BASE_CGU_OUT0_CLK source can't be PLL0USB."
#elif LPC_BASE_CGU_OUT0_CLK_SRC == CLK_SEL_PLL0AUDIO
#define  LPC_BASE_CGU_OUT0_CLK     LPC_PLL0AUDIO_CLK
#elif LPC_BASE_CGU_OUT0_CLK_SRC == CLK_SEL_PLL1
#define  LPC_BASE_CGU_OUT0_CLK     LPC_PLL1_CLK
#elif LPC_BASE_CGU_OUT0_CLK_SRC == CLK_SEL_IDIVA
#define  LPC_BASE_CGU_OUT0_CLK     LPC_IDIVA_CLK
#elif LPC_BASE_CGU_OUT0_CLK_SRC == CLK_SEL_IDIVB
#define  LPC_BASE_CGU_OUT0_CLK     LPC_IDIVB_CLK
#elif LPC_BASE_CGU_OUT0_CLK_SRC == CLK_SEL_IDIVC
#define  LPC_BASE_CGU_OUT0_CLK     LPC_IDIVC_CLK
#elif LPC_BASE_CGU_OUT0_CLK_SRC == CLK_SEL_IDIVD
#define  LPC_BASE_CGU_OUT0_CLK     LPC_IDIVD_CLK
#elif LPC_BASE_CGU_OUT0_CLK_SRC == CLK_SEL_IDIVE
#define  LPC_BASE_CGU_OUT0_CLK     LPC_IDIVE_CLK
#else
#error  "LPC_BASE_CGU_OUT0_CLK wrong clock source."
#endif

#if LPC_BASE_CGU_OUT1_CLK_SRC == CLK_SEL_32KHZ
#define  LPC_BASE_CGU_OUT1_CLK     RTC_XTAL
#elif LPC_BASE_CGU_OUT1_CLK_SRC == CLK_SEL_IRC
#define  LPC_BASE_CGU_OUT1_CLK     IRCOSCCLK
#elif LPC_BASE_CGU_OUT1_CLK_SRC == CLK_SEL_ENET_RX_CLK
#define  LPC_BASE_CGU_OUT1_CLK     ENET_RX_CLK
#elif LPC_BASE_CGU_OUT1_CLK_SRC == CLK_SEL_ENET_TX_CLK
#define  LPC_BASE_CGU_OUT1_CLK     ENET_TX_CLK
#elif LPC_BASE_CGU_OUT1_CLK_SRC == CLK_SEL_GP_CLKIN
#define  LPC_BASE_CGU_OUT1_CLK     GP_CLKIN_CLK
#elif LPC_BASE_CGU_OUT1_CLK_SRC == CLK_SEL_XTAL
#define  LPC_BASE_CGU_OUT1_CLK     XTAL
#elif LPC_BASE_CGU_OUT1_CLK_SRC == CLK_SEL_PLL0USB
#error   "LPC_BASE_CGU_OUT1_CLK source can't be PLL0USB."
#elif LPC_BASE_CGU_OUT1_CLK_SRC == CLK_SEL_PLL0AUDIO
#define  LPC_BASE_CGU_OUT1_CLK     LPC_PLL0AUDIO_CLK
#elif LPC_BASE_CGU_OUT1_CLK_SRC == CLK_SEL_PLL1
#define  LPC_BASE_CGU_OUT1_CLK     LPC_PLL1_CLK
#elif LPC_BASE_CGU_OUT1_CLK_SRC == CLK_SEL_IDIVA
#define  LPC_BASE_CGU_OUT1_CLK     LPC_IDIVA_CLK
#elif LPC_BASE_CGU_OUT1_CLK_SRC == CLK_SEL_IDIVB
#define  LPC_BASE_CGU_OUT1_CLK     LPC_IDIVB_CLK
#elif LPC_BASE_CGU_OUT1_CLK_SRC == CLK_SEL_IDIVC
#define  LPC_BASE_CGU_OUT1_CLK     LPC_IDIVC_CLK
#elif LPC_BASE_CGU_OUT1_CLK_SRC == CLK_SEL_IDIVD
#define  LPC_BASE_CGU_OUT1_CLK     LPC_IDIVD_CLK
#elif LPC_BASE_CGU_OUT1_CLK_SRC == CLK_SEL_IDIVE
#define  LPC_BASE_CGU_OUT1_CLK     LPC_IDIVE_CLK
#else
#error  "LPC_BASE_CGU_OUT1_CLK wrong clock source."
#endif

#define  LPC_CLK_M4_ETHERNET    LPC_BASE_M4_CLK

/*===========================================================================*/
/* Driver data structures and types.                                         */
/*===========================================================================*/

/**
 * @brief   Type of the realtime free counter value.
 */
typedef uint32_t halrtcnt_t;

/*===========================================================================*/
/* Driver macros.                                                            */
/*===========================================================================*/

/**
 * @brief   Returns the current value of the system free running counter.
 * @note    This service is implemented by returning the content of the
 *          DWT_CYCCNT register.
 *
 * @return              The value of the system free running counter of
 *                      type halrtcnt_t.
 *
 * @notapi
 */
#define hal_lld_get_counter_value()         DWT_CYCCNT

/**
 * @brief   Realtime counter frequency.
 * @note    The DWT_CYCCNT register is incremented directly by the cpu
 *          clock so this function returns LPC_BASE_M4_CLK.
 *
 * @return              The realtime counter frequency of type halclock_t.
 *
 * @notapi
 */
#define hal_lld_get_counter_frequency()     LPC_BASE_M4_CLK

/*===========================================================================*/
/* External declarations.                                                    */
/*===========================================================================*/

#include "lpc43xx_dma.h"

#ifdef __cplusplus
extern "C" {
#endif
  void hal_lld_init(void);
  void lpc_clock_init(void);
  void lpc_deep_sleep_enter(uint32_t core_type);
  void lpc_deep_sleep_exit(void);
  void lpc_deep_power_down_enter(uint32_t core_type);
#ifdef __cplusplus
}
#endif

#endif /* _HAL_LLD_H_ */

/** @} */
